xmls/requests/MOR_SG_OLD.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
   <env:Header/>
   <S:Body>
      <ns5:orderRequest xmlns="http://cio.att.com/commonheader/v3" xmlns:ns5="http://cio.att.com/order/management/model" xmlns:ns2="http://cio.att.com/entity/model" xmlns:ns4="http://cio.att.com/req/model" xmlns:ns3="http://cio.att.com/ord/model">
         <ns5:order>
            <ns4:eid>
               <ns2:context>OCX</ns2:context>
               <ns2:id>1-TNRCPAB93364</ns2:id>
               <ns2:entityType>SOR</ns2:entityType>
            </ns4:eid>
            <ns3:isBundle>true</ns3:isBundle>
            <ns3:user>MASS</ns3:user>
            <ns3:subOrders>
               <ns3:item>
                  <ns4:eid>
                     <ns2:context>OCX</ns2:context>
                     <ns2:id>302175442</ns2:id>
                     <ns2:entityType>Order</ns2:entityType>
                  </ns4:eid>
                  <ns4:type>DECOMPOSE</ns4:type>
                  <ns4:characteristics>
                     <ns2:item>
                        <ns2:name>ServiceGroupOrderId</ns2:name>
                        <ns2:value>302175442</ns2:value>
                     </ns2:item>
                     <ns2:item>
                        <ns2:name>projectId</ns2:name>
                        <ns2:value>10882</ns2:value>
                     </ns2:item>
                  </ns4:characteristics>
                  <ns4:associations>
                     <ns2:item>
                        <ns2:associationName>AssociatedServiceOrder</ns2:associationName>
                        <ns2:items>
                           <ns2:item>
                              <ns2:context>OCX</ns2:context>
                              <ns2:id>302175447</ns2:id>
                              <ns2:entityType>OrderAction</ns2:entityType>
                              <ns2:type>ACSM</ns2:type>
                              <ns2:product>MIS Access</ns2:product>
                           </ns2:item>
                        </ns2:items>
                     </ns2:item>
                     <ns2:item>
                        <ns2:associationName>AssociatedServiceOrder</ns2:associationName>
                        <ns2:items>
                           <ns2:item>
                              <ns2:context>OCX</ns2:context>
                              <ns2:id>302175445</ns2:id>
                              <ns2:entityType>OrderAction</ns2:entityType>
                              <ns2:type>MISM</ns2:type>
                              <ns2:product>MIS</ns2:product>
                           </ns2:item>
                        </ns2:items>
                     </ns2:item>
                  </ns4:associations>
                  <ns3:isBundle>false</ns3:isBundle>
                  <ns3:actionType>PR</ns3:actionType>
                  <ns3:actionSubType>NA</ns3:actionSubType>
                  <ns3:version>1</ns3:version>
               </ns3:item>
            </ns3:subOrders>
         </ns5:order>
      </ns5:orderRequest>
   </S:Body>
</S:Envelope>